In [1]:
# 누락된 데이터 처리하기
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
print(string_data)
print()
print(string_data.isnull())
print()
string_data[0] = None
print(string_data.isnull())

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

0     True
1    False
2     True
3    False
dtype: bool

In [2]:
# 누락된 데이터 골라내기
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna() # dropna 메서드로 null이 아닌 데이터와 색인값만 들어 있는 Series만 반환한다.

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
# 위 코드와 동일한 코드
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned # dropna 메서드는 기본적으로 NA 값이 하나라도 포함되어 있는 row를 제외시킨다.

     0    1    2
0  1.0  6.5  3.0

In [12]:
cleaned2 = data.dropna(how = 'all')
cleaned2
# how = 'all' 옵션을 넘기면 모두 NA 값인 row만 제외시킨다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
cleaned3 = data.dropna(axis = 1, how = 'all')
cleaned3
# axis = 1 옵션을 넘겨주면 column을 제외시킬 수 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.163086       NaN       NaN
1  1.016848       NaN       NaN
2  0.601798       NaN  0.268004
3 -1.263070       NaN  0.764421
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [17]:
df.dropna()

          0         1         2
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [19]:
df.dropna(thresh=2) # drop.(thresh = n) : NA를 제외한 n개 이상의 값이 포함된 row를 살펴볼 수 있다.

          0         1         2
2  0.601798       NaN  0.268004
3 -1.263070       NaN  0.764421
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [21]:
# 결측치 채우기
df.fillna(0)

          0         1         2
0 -0.163086  0.000000  0.000000
1  1.016848  0.000000  0.000000
2  0.601798  0.000000  0.268004
3 -1.263070  0.000000  0.764421
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [23]:
df.fillna({1 : 0.5, 2 : 0})
# fillna에 사전값을 넘겨서 각 column마다 다른 값을 채울 수도 있다.

          0         1         2
0 -0.163086  0.500000  0.000000
1  1.016848  0.500000  0.000000
2  0.601798  0.500000  0.268004
3 -1.263070  0.500000  0.764421
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [25]:
_ = df.fillna(0, inplace = True)
df
# fillna()는 새로운 객체를 반환하지만 inplace=True를 사용함으로써 기존 객체를 변경할 수도 있다.

          0         1         2
0 -0.163086  0.000000  0.000000
1  1.016848  0.000000  0.000000
2  0.601798  0.000000  0.268004
3 -1.263070  0.000000  0.764421
4 -1.636955  0.979777 -0.315963
5  0.683988  0.041021 -0.991981
6  1.775722 -0.298231  0.830205

In [26]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.172170 -0.399941 -1.052914
1  0.739484 -0.990687 -2.265116
2  1.249486       NaN -0.697375
3 -0.754104       NaN -0.751486
4 -0.884349       NaN       NaN
5 -0.535178       NaN       NaN

In [27]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.172170 -0.399941 -1.052914
1  0.739484 -0.990687 -2.265116
2  1.249486 -0.990687 -0.697375
3 -0.754104 -0.990687 -0.751486
4 -0.884349 -0.990687 -0.751486
5 -0.535178 -0.990687 -0.751486

In [30]:
df.fillna(method = 'ffill', limit=2)

          0         1         2
0 -1.172170 -0.399941 -1.052914
1  0.739484 -0.990687 -2.265116
2  1.249486 -0.990687 -0.697375
3 -0.754104 -0.990687 -0.751486
4 -0.884349       NaN -0.751486
5 -0.535178       NaN -0.751486

In [31]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) # 이 처럼 fillna()를 이용해서 데이터의 평균값이나 중간값으로 채울 수도 있다.

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# 데이터 변형
## 중복 제거

data = pd.DataFrame({'k1' : ['one', 'two']*3 + ['two'],
                    'k2' : [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()
# duplicated 메서드는 각 row가 중복인지 아닌지 알려주는 불리언 Series를 반환한다.

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()
# drop_duplicated 메서드는 중복인 row를 제외한(duplicated 배열이 False인) DataFrame을 반환한다.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1']) # k1 column에 기반해서 중복을 걸러냈다.(아마 k1 column 값(one,two)과 같은 건 모두 삭제된듯)

    k1  k2  v1
0  one   1   0
1  two   1   1

In [38]:
data.drop_duplicates(['k1', 'k2'], keep='last')
# duplicated와 drop_duplicated는 기본적으로 처음 발견된 값을 유지한다. keep = 'last' 옵션을 넘기면 마지막으로 발견된 값을 반환한다.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
# 함수나 매핑을 이용해서 데이터 변형하기

data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [48]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [49]:
lowercased = data['food'].str.lower() # str.lower 메서드로 소문자로 변경한다.
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)
data
# Series의 map 메서드는 사전류의 객체나 어떤 함수를 받을 수 있다.

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
# 위 코드와 같은 일을 수행했다.

data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [2]:
# 값 치환하기

data = pd.Series([1, -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [3]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [4]:
data.replace([-999, -1000], np.nan) # 여러 개의 값을 한 번에 치환

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [5]:
data.replace([-999, -1000], [np.nan, 0]) # 치환하려는 값마다 다른 값으로 치환 가능(1)

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [6]:
data.replace({-999 : np.nan, -1000 : 0}) # 치환하려는 값마다 다른 값으로 치환 가능(2)

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [8]:
# 축 색인 이름 바꾸기

data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [9]:
transform = lambda x : x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [10]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [11]:
data.rename(index=str.title, columns=str.upper)
# rename 메서드 : 원래 객체를 변경하지 않고 새로운 객체 생성

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [13]:
data.rename(index = {'OHIO' : 'INDIANA'},
           columns = {'three' : 'peekaboo'})
# rename 메서드는 사전 형식의 객체릴 이용해서 축 이름 일부를 변경할 수도 있다.

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [17]:
data.rename(index={'OHIO' : 'INDIANA'}, inplace = True) # inplace = True : 원본 데이터 변경
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [4]:
# 개별화와 양자화

ages = [20, 22, 25 , 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats # 그룹 이름이 담긴 배열

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [5]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [6]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [7]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [8]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [5]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [7]:
data = np.random.randn(20)
pd.cut(data,4,precision=2) # precision=2 : 소수점 아래 2자리까지로 제한, 4 : 4분위로 분류

[(0.47, 1.42], (-1.44, -0.49], (-0.49, 0.47], (-0.49, 0.47], (-0.49, 0.47], ..., (0.47, 1.42], (-0.49, 0.47], (-0.49, 0.47], (-0.49, 0.47], (0.47, 1.42]]
Length: 20
Categories (4, interval[float64]): [(-2.4, -1.44] < (-1.44, -0.49] < (-0.49, 0.47] < (0.47, 1.42]]

In [9]:
data = np.random.randn(100) # 정규분포
cats = pd.qcut(data, 4)
cats

[(-0.626, -0.119], (-2.221, -0.626], (0.45, 2.395], (-0.119, 0.45], (0.45, 2.395], ..., (-0.119, 0.45], (0.45, 2.395], (-0.626, -0.119], (-0.119, 0.45], (-0.626, -0.119]]
Length: 100
Categories (4, interval[float64]): [(-2.221, -0.626] < (-0.626, -0.119] < (-0.119, 0.45] < (0.45, 2.395]]

In [11]:
pd.value_counts(cats)

(0.45, 2.395]       25
(-0.119, 0.45]      25
(-0.626, -0.119]    25
(-2.221, -0.626]    25
dtype: int64

In [12]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.269, -0.119], (-1.269, -0.119], (-0.119, 1.361], (-0.119, 1.361], (1.361, 2.395], ..., (-0.119, 1.361], (-0.119, 1.361], (-1.269, -0.119], (-0.119, 1.361], (-1.269, -0.119]]
Length: 100
Categories (4, interval[float64]): [(-2.221, -1.269] < (-1.269, -0.119] < (-0.119, 1.361] < (1.361, 2.395]]

In [14]:
# 특잇값을 찾고 제외하기

data = pd.DataFrame(np.random.randn(1000,4))
data

            0         1         2         3
0   -0.982633 -0.470218  0.474868  1.012949
1    1.241158  1.159138 -2.409689 -1.282716
2   -0.177923 -0.350769 -1.631632  0.027059
3   -0.238334 -0.396535 -0.357759  0.099563
4    0.982512  1.552743 -0.277910  0.426208
..        ...       ...       ...       ...
995 -0.532330  1.953627  0.480674 -0.110037
996 -0.563269 -0.614356 -0.424974 -0.830260
997  0.103663  0.570206  0.123482 -0.967954
998  0.146583 -0.779851 -0.546207 -1.004688
999  0.031383  0.482716 -0.123564  1.959720

[1000 rows x 4 columns]

In [15]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.032383     0.015926    -0.047828     0.055761
std       0.983642     1.020957     0.981734     1.013690
min      -3.342257    -3.068983    -3.030154    -3.273960
25%      -0.632547    -0.614507    -0.696602    -0.620537
50%       0.000575    -0.008343    -0.027128     0.087331
75%       0.711598     0.685729     0.608636     0.747245
max       3.474405     3.058040     4.303180     4.214113

In [16]:
# DataFrame의 한 column에서 절대값이 3을 초과하는 값을 찾아내기
col = data[2]
col[np.abs(col)>3]

5      4.303180
599   -3.030154
825    3.005534
Name: 2, dtype: float64

In [17]:
data[(np.abs(data>3)).any(1)]
# any 메서드로 해당 조건을 갖춘 값이 들어있는 모든 row 선택 가능

            0         1         2         3
5   -0.018642  0.646864  4.303180 -0.648372
256  0.538430  3.058040 -0.820832 -0.216463
262  3.474405 -0.461150  2.021614  0.256760
583  0.416320  2.048209  0.618824  4.214113
825 -1.783877 -0.364437  3.005534 -0.933574
923  2.104765  0.092214  0.452118  3.064642

In [18]:
data[np.abs(data)>3] = np.sign(data) *3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.032799     0.015937    -0.049106     0.054806
std       0.979198     1.020579     0.976696     1.008212
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.632547    -0.614507    -0.696602    -0.620537
50%       0.000575    -0.008343    -0.027128     0.087331
75%       0.711598     0.685729     0.608636     0.747245
max       3.000000     3.000000     3.000000     3.000000

In [19]:
np.sign(data).head()

# np.sign(data) 는 data 값이 양수인지 음수인지에 따라 1이나 -1이 담긴 배열을 반환한다.

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

In [22]:
# 치환과 임의 샘플링

# np.random.permutation 함수를 이용하면 Series나 DataFrame의 row를 쉽게 임의 순서로 재배치할 수 있다.
# 순서를 바꾸고 싶은 만큼의 길이를 permutation 함수로 넘기면 바뀐 순서가 담긴 배열이 생성된다.

df = pd.DataFrame(np.arange(5*4).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [23]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 2, 4, 3])

In [24]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [26]:
# 위 코드와 같은 기능이지만 일부만 임의로 선택 가능한 방법
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [27]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
2   -1
3    6
0    5
0    5
4    4
4    4
2   -1
1    7
0    5
dtype: int64

In [29]:
# 표시자/더미 변수 계산하기

df = pd.DataFrame({'key' : ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1' : range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [30]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [34]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('examples/datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)
movies[:10]

/opt/anaconda3/lib/python3.8/site-packages/pandas/io/parsers.py:765: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [35]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [38]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [39]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [41]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [46]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [47]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [48]:
# 문자열 다루기
## 문자열 객체 메서드

val = 'a, b, guido'
val.split(',')

['a', ' b', ' guido']

In [49]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [51]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [52]:
'::'.join(pieces)

'a::b::guido'

In [53]:
'guido' in val

True

In [54]:
val.index(',')

1

In [55]:
val.find(':')

-1

In [56]:
val.index(':')

ValueError: substring not found

In [57]:
val.count(',')

2

In [58]:
val.replace(',', '::')

'a:: b:: guido'

In [59]:
val.replace(',','')

'a b guido'

In [4]:
# 정규 표현식 : 텍스트에서 문자열 패턴을 찾는 유연한 방법을 제공한다. 
# 파이썬에는 re모듈이 내장되어 있어서 문자열에 대한 정규 표현식을 처리한다.

import re

text = "foo bar\t bax\t qux"
re.split('\s+', text)

['foo', 'bar', 'bax', 'qux']

In [6]:
regex = re.compile('\s+') 
# re.split('\s+', text) 를 사용하면 먼저 정규 표현식이 컴파일되고 그 다음에 split 메서드가 실행된다.
regex.split(text)

['foo', 'bar', 'bax', 'qux']

In [63]:
regex.findall(text)

[' ', '\t ', '\t ']

In [13]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gamil.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags = re.IGNORECASE)

In [66]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gamil.com', 'ryan@yahoo.com']

In [67]:
m = regex.search(text)
m

In [68]:
text[m.start():m.end()]

'dave@google.com'

In [9]:
print(regex.match(text))

None

In [15]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [11]:
m = regex.match('wes@bright.net')
m.groups()

('wes', 'bright', 'net')

In [16]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gamil', 'com'),
 ('ryan', 'yahoo', 'com')]

In [17]:
data = {'Dave' : 'dave@gooogle.com', 'Steve' : 'steve@gmail.com',
        'ROb' : 'rob@gmail.com', 'Wes' : np.nan}
data = pd.Series(data)
data

Dave     dave@gooogle.com
Steve     steve@gmail.com
ROb         rob@gmail.com
Wes                   NaN
dtype: object

In [18]:
data.isnull()

Dave     False
Steve    False
ROb      False
Wes       True
dtype: bool

In [19]:
data.str.contains('gmail')

Dave     False
Steve     True
ROb       True
Wes        NaN
dtype: object

In [20]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [21]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, gooogle, com)]
Steve     [(steve, gmail, com)]
ROb         [(rob, gmail, com)]
Wes                         NaN
dtype: object

In [23]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
ROb      True
Wes       NaN
dtype: object

In [24]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [25]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [26]:
data.str[:5]

Dave     dave@
Steve    steve
ROb      rob@g
Wes        NaN
dtype: object